Repository: astrov3/ssi-management
Catalog: mobile-app-frontend/lib/l10n/app_*.arb
Languages: vi

source: Welcome back
vi: Chào mừng trở lại

# loginToIdentityWallet
source: Login to your identity wallet
vi: Đăng nhập vào ví danh tính của bạn

# privateKeyOrMnemonic
source: Private Key or Mnemonic (12 words)
vi: Private Key hoặc Mnemonic (12 từ)

source: or
vi: hoặc

source: Login
vi: Đăng nhập

source: Logging in...
vi: Đang đăng nhập...

source: Please enter Private Key or Mnemonic
vi: Vui lòng nhập Private Key hoặc Mnemonic

# loginError
source: Login error: Invalid Private Key or Mnemonic
vi: Lỗi đăng nhập: Private Key hoặc Mnemonic không hợp lệ

source: MetaMask connection failed
vi: Kết nối MetaMask thất bại

# cannotGetWalletInfoFromMetamask
source: Cannot get wallet information from MetaMask. Please ensure MetaMask is installed and logged in.
vi: Không thể lấy thông tin ví từ MetaMask. Vui lòng đảm bảo MetaMask đã được cài đặt và đăng nhập.

# metamaskConnectionInterrupted
source: MetaMask connection interrupted. Please try again.
vi: Kết nối MetaMask bị gián đoạn. Vui lòng thử lại.

source: Trust Wallet connection failed
vi: Kết nối Trust Wallet thất bại

# cannotGetWalletInfoFromTrustWallet
source: Cannot get wallet information from Trust Wallet. Please ensure Trust Wallet is installed and logged in.
vi: Không thể lấy thông tin ví từ Trust Wallet. Vui lòng đảm bảo Trust Wallet đã được cài đặt và đăng nhập.

# trustWalletConnectionTimeout
source: Trust Wallet connection timed out. Please ensure Trust Wallet is opened and accepts the connection.
vi: Kết nối Trust Wallet quá thời gian chờ. Vui lòng đảm bảo Trust Wallet đã được mở và chấp nhận kết nối.

source: Hello,
vi: Xin chào,

source: User
vi: Người dùng

source: Identity Wallet
vi: Ví Danh Tính

source: Statistics
vi: Thống kê

source: Credentials
vi: Chứng chỉ

source: Verified
vi: Đã xác minh

source: Balance
vi: Số dư

source: Register DID
vi: Đăng ký DID

source: Quick Actions
vi: Hành động nhanh

source: Manage DID
vi: Quản lý DID

source: View and manage your DID
vi: Xem và quản lý DID của bạn

source: Issue Credential
vi: Phát hành chứng chỉ

source: Create and issue new VC
vi: Tạo và phát hành VC mới

# registerDidOnBlockchain
source: Register identity on blockchain
vi: Đăng ký danh tính trên blockchain

source: Loading data...
vi: Đang tải dữ liệu...

# didRegistered
source: DID has been registered! TX: {txHash}
vi: DID đã được đăng ký! TX: {txHash}

# vcIssued
source: VC has been issued! TX: {txHash}
vi: VC đã được phát hành! TX: {txHash}

source: Error
vi: Lỗi

# errorOccurred
source: Error: {error}
vi: Lỗi: {error}

source: Close
vi: Đóng

source: Cancel
vi: Hủy

source: Register
vi: Đăng ký

source: Issue
vi: Phát hành

source: Processing...
vi: Đang xử lý...

source: Address copied
vi: Đã sao chép địa chỉ

source: Profile
vi: Hồ Sơ

source: Wallet Info
vi: Thông tin ví

source: Change Wallet Name
vi: Đổi tên ví

source: Backup Keys
vi: Sao lưu khóa

source: Security
vi: Bảo mật

source: Transaction History
vi: Lịch sử giao dịch

source: Settings
vi: Cài đặt

source: Help
vi: Trợ giúp

source: Logout
vi: Đăng xuất

source: Confirm Logout
vi: Xác nhận đăng xuất

# confirmLogoutMessage
source: Are you sure you want to logout? Make sure you have backed up your Private Key or Mnemonic.
vi: Bạn có chắc chắn muốn đăng xuất? Đảm bảo bạn đã sao lưu Private Key hoặc Mnemonic.

source: Wallet Address
vi: Địa chỉ ví

# doNotShareThisInfo
source: Do not share this information with anyone!
vi: Không chia sẻ thông tin này với bất kỳ ai!

# changeWalletNameTitle
source: Change Wallet Name
vi: Đổi tên ví

source: Wallet Name
vi: Tên ví

# enterWalletName
source: Enter a name for your wallet
vi: Nhập tên cho ví của bạn

source: Address
vi: Địa chỉ

source: Save
vi: Lưu

source: Wallet name saved
vi: Đã lưu tên ví

# backupKeysTitle
source: Backup Keys
vi: Sao lưu khóa

# importantSaveInfo
source: IMPORTANT: Save this information in a safe place!
vi: QUAN TRỌNG: Lưu thông tin này ở nơi an toàn!

# recoveryPhrase
source: Recovery Phrase (12 words):
vi: Cụm từ khôi phục (12 từ):

source: Mnemonic copied
vi: Đã sao chép mnemonic

# mnemonicNotAvailable
source: Mnemonic not available. You may have imported wallet using Private Key.
vi: Mnemonic không khả dụng. Bạn có thể đã import ví bằng Private Key.

source: Verification
vi: Xác Minh

source: My QR Code
vi: Mã QR của tôi

# shareQrCodeMessage
source: Share this QR code so others can verify your identity
vi: Chia sẻ mã QR này để người khác có thể xác minh danh tính của bạn

source: Verify VC
vi: Xác minh VC

source: Manual Input
vi: Nhập thủ công

source: Scan QR
vi: Quét QR

# qrScanningFeatureComingSoon
source: QR scanning feature will be integrated in the next version
vi: Chức năng quét QR sẽ được tích hợp trong phiên bản tiếp theo

# youCanUseManualInput
source: Currently you can use the "Manual Input" feature
vi: Hiện tại bạn có thể sử dụng chức năng "Nhập thủ công"

# verifyVCTitle
source: Verify VC
vi: Xác minh VC

source: Hash copied
vi: Đã sao chép hash

source: University Degree
vi: Bằng Đại Học

source: Professional Certificate
vi: Chứng Chỉ Nghề Nghiệp

source: ID Card
vi: CMND/CCCD

source: Driver's License
vi: Giấy Phép Lái Xe

source: Health Insurance
vi: Bảo Hiểm Y Tế

source: Membership Card
vi: Thẻ Thành Viên

source: Certificate
vi: Chứng Nhận

source: Badge
vi: Huy Hiệu

source: Language
vi: Ngôn ngữ

source: Select Language
vi: Chọn ngôn ngữ

source: Network
vi: Mạng

source: Verify
vi: Xác minh

# verificationError
source: Verification error: {error}
vi: Lỗi xác minh: {error}

source: Valid
vi: Hợp lệ

source: Invalid
vi: Không hợp lệ

# credentialVerified
source: This credential has been verified and is valid
vi: Chứng chỉ này đã được xác minh và còn hiệu lực

# credentialInvalid
source: This credential is invalid or has been revoked
vi: Chứng chỉ này không hợp lệ hoặc đã bị thu hồi

source: Invalid index
vi: Index không hợp lệ

source: Loading credentials...
vi: Đang tải chứng chỉ...

source: No credentials
vi: Chưa có chứng chỉ

# pressAddToAddCredential
source: Press the + button to add a new credential
vi: Nhấn nút + để thêm chứng chỉ mới

# pleaseConnectWallet
source: Please connect wallet first
vi: Vui lòng kết nối ví trước

# creatingVCAndUploading
source: Creating VC and uploading to IPFS...
vi: Đang tạo VC và upload lên IPFS...

source: Revoking VC...
vi: Đang thu hồi VC...

# vcRevoked
source: VC has been revoked! TX: {txHash}
vi: VC đã bị thu hồi! TX: {txHash}

source: Copy Hash
vi: Sao chép

source: Revoke
vi: Thu hồi

source: Revoked
vi: Đã thu hồi

source: Issue New VC
vi: Phát hành VC mới

source: Credential Type
vi: Loại chứng chỉ

source: Credential Name
vi: Tên chứng chỉ

source: Description
vi: Mô tả

# exampleEducationalCredential
source: Example: EducationalCredential, ProfessionalCredential
vi: Ví dụ: EducationalCredential, ProfessionalCredential

source: Example: University Degree
vi: Ví dụ: Bằng Đại Học

# credentialDescription
source: Detailed description of the credential
vi: Mô tả chi tiết về chứng chỉ

source: Unknown
vi: Không xác định

source: Overview
vi: Tổng quan

source: Full Name
vi: Tên đầy đủ

source: Password
vi: Mật khẩu

source: Wallet Created
vi: Ví đã được tạo

source: Your wallet address:
vi: Địa chỉ ví của bạn:

# saveRecoveryPhrase
source: Save the recovery phrase below!
vi: Lưu cụm từ khôi phục bên dưới!

source: Recovery phrase copied
vi: Đã sao chép cụm từ khôi phục

# continueButton
source: Continue
vi: Tiếp tục

source: Invalid QR Code
vi: Mã QR không hợp lệ

# invalidQRCodeMessage
source: The scanned QR code does not contain valid SSI data. Please scan a valid DID, VC, or verification request QR code.
vi: Mã QR đã quét không chứa dữ liệu SSI hợp lệ. Vui lòng quét mã QR DID, VC hoặc yêu cầu xác minh hợp lệ.

# positionQRCodeInFrame
source: Position the QR code within the frame to scan
vi: Đặt mã QR trong khung để quét

source: Try Again
vi: Thử lại

source: Details
vi: Chi tiết

source: Verifiable Credential
vi: Chứng chỉ có thể xác minh

# defaultWalletName
source: SSI Account
vi: Tài khoản SSI

# creatingDidAndUploadingToIpfs
source: Creating DID document and uploading to IPFS...
vi: Đang tạo DID document và upload lên IPFS...

source: Uploading logo to IPFS...
vi: Đang upload logo lên IPFS...

source: Uploading document to IPFS...
vi: Đang upload tài liệu lên IPFS...

source: Creating DID document...
vi: Đang tạo DID document...

source: Cannot get current wallet address
vi: Không thể lấy địa chỉ ví hiện tại

# sendingTransactionToMetamask
source: Sending transaction to MetaMask... Please open MetaMask wallet and confirm the transaction.
vi: Đang gửi transaction đến MetaMask... Vui lòng mở MetaMask và xác nhận transaction.

source: Registering DID on blockchain...
vi: Đang đăng ký DID trên blockchain...

# trustedVerifierAdded
source: Trusted verifier added: {txHash}
vi: Đã thêm trusted verifier: {txHash}

# trustedVerifierRemoved
source: Trusted verifier removed: {txHash}
vi: Đã xoá trusted verifier: {txHash}

source: Connect your wallet to continue
vi: Kết nối ví của bạn để tiếp tục

# adminPanel
source: Admin Panel - Manage Trusted Verifiers
vi: Quản trị - Quản lý Trusted Verifiers

source: Verifier Address *
vi: Địa chỉ Verifier *

source: Add/Enable
vi: Thêm/Kích hoạt

source: Remove/Disable
vi: Xóa/Vô hiệu hóa

source: Please enter verifier address
vi: Vui lòng nhập địa chỉ verifier

source: Add Verifier
vi: Thêm Verifier

source: Remove Verifier
vi: Xóa Verifier

# createYourDecentralizedIdentity
source: Create your decentralized identity (DID)
vi: Tạo danh tính phi tập trung (DID) của bạn

source: Fill form
vi: Điền form

source: Upload document
vi: Tải lên tài liệu

# walletAddressLabel
source: Wallet Address
vi: Địa chỉ ví

source: Display name *
vi: Tên hiển thị *

# enterYourOrOrgName
source: Enter your or your organization name
vi: Nhập tên của bạn hoặc tổ chức

# describeYourselfOrOrg
source: Describe yourself or your organization (optional)
vi: Mô tả về bạn hoặc tổ chức (tùy chọn)

source: Contact address (optional)
vi: Địa chỉ liên hệ (tùy chọn)

source: Phone number
vi: Số điện thoại

source: Logo (optional)
vi: Logo (tùy chọn)

source: Choose logo
vi: Chọn logo

source: Take photo
vi: Chụp ảnh

source: Choose from gallery
vi: Chọn từ thư viện

# selectedLogo
source: Selected logo: {filename}
vi: Logo đã chọn: {filename}

source: Choose logo (JPG, PNG)
vi: Chọn logo (JPG, PNG)

source: Upload document to register DID
vi: Tải lên tài liệu để đăng ký DID

# uploadDocumentDescription
source: You can upload a PDF, JSON file, or image containing credential information. If it is a JSON file, metadata will be extracted automatically.
vi: Bạn có thể upload file PDF, JSON, hoặc hình ảnh chứa thông tin credential. Nếu là file JSON, dữ liệu sẽ được tự động trích xuất.

# documentRequired
source: Document *
vi: Tài liệu *

source: Document selected
vi: Tài liệu đã chọn

# chooseDocument
source: Choose document (PDF, JSON, JPG, PNG)
vi: Chọn tài liệu (PDF, JSON, JPG, PNG)

# noteJsonWillBeParsed
source: Note: JSON files will be parsed automatically to extract metadata. PDF and image files will be stored on IPFS.
vi: Lưu ý: File JSON sẽ được phân tích tự động để trích xuất metadata. File PDF và hình ảnh sẽ được lưu trên IPFS.

# pleaseEnterName
source: Please enter a name
vi: Vui lòng nhập tên

source: Please choose document
vi: Vui lòng chọn tài liệu

# adminPanelAction
source: Admin Panel
vi: Quản trị

# manageVerifiers
source: Manage trusted verifiers
vi: Quản lý trusted verifiers

source: Update DID
vi: Cập nhật DID

source: Upload document to update DID
vi: Tải lên tài liệu để cập nhật DID

source: Update
vi: Cập nhật

# updateYourDidInformation
source: Update your decentralized identity (DID) information
vi: Cập nhật thông tin danh tính phi tập trung (DID) của bạn

# errorPickingImage
source: Error picking image: {error}
vi: Lỗi chọn ảnh: {error}

# errorPickingFile
source: Error picking file: {error}
vi: Lỗi chọn file: {error}

# defaultGateway
source: Default
vi: Mặc định

source: Original
vi: Gốc

source: Cannot open link
vi: Không thể mở liên kết

# cannotOpenFile
source: Cannot open file: {error}
vi: Không thể mở file: {error}

# verifiedStatus
source: Verified
vi: Đã xác minh

source: Unverified
vi: Chưa xác minh

source: View details
vi: Xem chi tiết

source: Verification Queue
vi: Hàng đợi xác minh

source: Refresh
vi: Làm mới

source: No verification requests
vi: Không có yêu cầu xác minh

# onlyTrustedVerifiersCanSee
source: Only trusted verifiers can see and process verification requests.
vi: Chỉ trusted verifiers mới có thể xem và xử lý yêu cầu xác minh.

# credentialVerifiedSuccessfully
source: Credential verified successfully! Hash: {hash}
vi: Xác minh chứng chỉ thành công! Hash: {hash}

# verificationErrorMessage
source: Verification error: {error}
vi: Lỗi xác minh: {error}

# verificationCancelledInWallet
source: Verification was cancelled in wallet. Please try again.
vi: Xác minh đã bị hủy trong ví. Vui lòng thử lại.

# verificationTimedOut
source: Verification request timed out. Please try again.
vi: Yêu cầu xác minh đã hết thời gian chờ. Vui lòng thử lại.

# confirmCancelVerificationRequest
source: Are you sure you want to cancel this verification request?
vi: Bạn có chắc chắn muốn hủy yêu cầu xác minh này?

# requestCancelledSuccessfully
source: Request cancelled successfully! Hash: {hash}
vi: Đã hủy yêu cầu thành công! Hash: {hash}

# errorCancellingRequest
source: Error cancelling request: {error}
vi: Lỗi hủy yêu cầu: {error}

# cancellationRejectedInWallet
source: Cancellation was rejected in wallet. Please try again.
vi: Hủy bỏ đã bị từ chối trong ví. Vui lòng thử lại.

# cancellationTimedOut
source: Cancellation request timed out. Please try again.
vi: Yêu cầu hủy đã hết thời gian chờ. Vui lòng thử lại.

# ownerRegisterOrManageDid
source: You are an owner. Register or manage your DID.
vi: Bạn là owner. Hãy đăng ký hoặc quản lý DID của bạn.

source: DID Information
vi: Thông tin DID

source: Issued At
vi: Thời gian phát hành

source: Expiration
vi: Thời gian hết hạn

source: Copied
vi: Đã sao chép

# notTrustedVerifierTitle
source: You are not a trusted verifier
vi: Bạn không phải trusted verifier

# notTrustedVerifierMessage
source: Only trusted verifiers can see and process verification requests.
vi: Chỉ trusted verifiers mới có thể xem và xử lý yêu cầu xác minh.

# noVerificationRequestsTitle
source: No verification requests
vi: Không có yêu cầu xác minh

# noVerificationRequestsMessage
source: New verification requests will appear here for quick processing.
vi: Các yêu cầu xác minh mới sẽ xuất hiện tại đây để xử lý nhanh.

# moreRequests
source: +{count} more request(s)
vi: +{count} yêu cầu khác

# manualVerifyDescription
source: Enter orgID, VC index and hash to verify manually when QR scanning is not possible.
vi: Nhập orgID, VC index và hash để xác minh thủ công khi không thể quét QR.

# walletAddressNotFound
source: Wallet address not found. Please open your wallet first.
vi: Không tìm thấy địa chỉ ví. Vui lòng mở ví trước.

# connectWalletToDisplayQr
source: Connect wallet or WalletConnect to display QR code.
vi: Kết nối ví hoặc WalletConnect để hiển thị mã QR.

source: Select credential to share
vi: Chọn credential để chia sẻ

# expiryShort
source: Exp: {date}
vi: HSD: {date}

# statusRevoked
source: Revoked
vi: Đã thu hồi

# statusVerified
source: Verified
vi: Đã xác minh

# statusNotVerified
source: Not verified
vi: Chưa xác minh

# queueSent
source: Sent
vi: Gửi

# queueAny
source: Any
vi: Bất kỳ

# timeDaysAgo
source: {count} day(s) ago
vi: {count} ngày trước

# timeHoursAgo
source: {count} hour(s) ago
vi: {count} giờ trước

# timeMinutesAgo
source: {count} minute(s) ago
vi: {count} phút trước

# timeJustNow
source: Just now
vi: Vừa xong

source: Authorize Issuer
vi: Ủy quyền Issuer

source: Issuer Address
vi: Địa chỉ Issuer

source: Authorize
vi: Ủy quyền

source: Create and issue Verifiable Credential
vi: Tạo và phát hành Verifiable Credential

# credentialTypeLabel
source: Credential Type *
vi: Loại Credential *

# credentialTypeHint
source: Example: EducationalCredential, IdentityCredential
vi: Ví dụ: EducationalCredential, IdentityCredential

# subjectNameLabel
source: Subject Name *
vi: Tên chủ thể *

# subjectNameHint
source: Name of credential recipient
vi: Tên người nhận credential

# subjectEmailLabel
source: Subject Email
vi: Email chủ thể

source: Expiration Date (optional)
vi: Ngày hết hạn (tùy chọn)

source: Select expiration date
vi: Chọn ngày hết hạn

source: Upload document to issue VC
vi: Upload tài liệu để phát hành VC

source: Please enter subject name
vi: Vui lòng nhập tên chủ thể

source: Government ID
vi: Căn Cước Công Dân

source: Passport
vi: Hộ Chiếu

source: Driver License
vi: Bằng Lái Xe

source: Training Certificate
vi: Chứng Chỉ Đào Tạo

source: Employment Credential
vi: Giấy Chứng Nhận Công Tác

source: Work Permit
vi: Giấy Phép Lao Động

source: Vaccination Certificate
vi: Giấy Chứng Nhận Tiêm Chủng

source: Credential
vi: Chứng Nhận

source: No DID
vi: Chưa có DID

# registerDidToStartUsingServices
source: Register a DID to start using services
vi: Đăng ký DID để bắt đầu sử dụng dịch vụ

# didDeactivated
source: DID has been deactivated
vi: DID đã bị vô hiệu hóa

source: No DID information available
vi: Không có thông tin DID

# noPermissionUpdateDid
source: You do not have permission to update this DID
vi: Bạn không có quyền cập nhật DID này

# noPermissionDeactivateDid
source: You do not have permission to deactivate this DID
vi: Bạn không có quyền vô hiệu hóa DID này

# noPermissionAuthorizeIssuer
source: You do not have permission to authorize an issuer
vi: Bạn không có quyền ủy quyền issuer

# issuerAddressNotValid
source: Issuer address is not valid
vi: Địa chỉ issuer không hợp lệ

source: Authorizing issuer...
vi: Đang ủy quyền issuer...

# issuerAuthorizedSuccessfully
source: Issuer has been authorized successfully!
vi: Đã ủy quyền issuer thành công!

# confirmDeactivateDid
source: Confirm DID deactivation
vi: Xác nhận vô hiệu hóa DID

# deactivateDidWarning
source: Are you sure you want to deactivate this DID? After deactivation, you will not be able to issue new VCs.
vi: Bạn có chắc chắn muốn vô hiệu hóa DID này? Sau khi vô hiệu hóa, bạn sẽ không thể phát hành VC mới.

source: Deactivating DID...
vi: Đang vô hiệu hóa DID...

source: Deactivate DID
vi: Vô hiệu hóa DID

# errorDeactivatingDid
source: Error deactivating DID: {error}
vi: Lỗi vô hiệu hóa DID: {error}

# errorAuthorizingIssuer
source: Error authorizing issuer: {error}
vi: Lỗi ủy quyền issuer: {error}

source: Please select credential type
vi: Vui lòng chọn loại chứng nhận

source: Please select credential type first
vi: Vui lòng chọn loại chứng nhận trước

# informationFilledFromQR
source: Information filled from QR code
vi: Đã điền thông tin từ QR code

# cannotReadQRCode
source: Cannot read information from QR code
vi: Không thể đọc thông tin từ QR code

# errorScanningQR
source: Error scanning QR code: {error}
vi: Lỗi quét QR code: {error}

source: Select Image Source
vi: Chọn nguồn ảnh

# imageSavedOCRLater
source: Image saved. OCR will be supported in the next version.
vi: Đã lưu ảnh. OCR sẽ được hỗ trợ trong phiên bản tiếp theo.

source: Information filled from image
vi: Đã điền thông tin từ ảnh

# cannotReadFromImage
source: Cannot read information from image. Image saved.
vi: Không thể đọc thông tin từ ảnh. Đã lưu ảnh.

# errorOCR
source: OCR error: {error}. Image saved.
vi: Lỗi OCR: {error}. Đã lưu ảnh.

source: Create New Credential
vi: Tạo Chứng Nhận Mới

source: Select Credential Type
vi: Chọn loại chứng nhận

source: Scan QR
vi: Quét QR

source: OCR from Image
vi: OCR từ ảnh

source: Create Credential
vi: Tạo Chứng Nhận

# pleaseFillRequiredFields
source: Please fill in all required fields
vi: Vui lòng điền đầy đủ thông tin bắt buộc

# fieldRequired
source: {field} is required
vi: {field} là bắt buộc

source: Invalid value
vi: Giá trị không hợp lệ

# requestVerificationTitle
source: Request Verification
vi: Gửi yêu cầu xác thực

# requestVerificationDescription
source: The entire credential content will be sent automatically to the verifier.
vi: Toàn bộ nội dung credential sẽ được gửi tự động đến cơ quan xác thực.

# requestVerificationAddressLabel
source: Verifier address *
vi: Địa chỉ verifier *

# requestVerificationAddressHint
source: 0x... (leave empty to allow any verifier)
vi: 0x... (để trống nếu cho phép bất kỳ verifier nào)

# requestVerificationSubmit
source: Send Request
vi: Gửi yêu cầu

source: Loading credential information...
vi: Đang tải thông tin credential...

# unableToLoadCredentialInformation
source: Unable to load credential information: {error}
vi: Không thể tải thông tin credential: {error}

# credentialMissingInformation
source: Credential has no information to send. Please check again.
vi: Credential không có dữ liệu để gửi. Vui lòng kiểm tra lại.

# uploadingFullCredential
source: Uploading full credential content to IPFS...
vi: Đang tải toàn bộ credential lên IPFS...

# sendingVerificationRequest
source: Sending verification request to the blockchain...
vi: Đang gửi yêu cầu xác thực lên blockchain...

# verificationRequestSuccess
source: Verification request sent successfully!\nHash: {hash}
vi: Yêu cầu xác thực đã được gửi thành công!\nHash: {hash}

# verificationRequestCancelled
source: Verification request was cancelled in your wallet. Please try again.
vi: Yêu cầu xác thực đã bị hủy trong ví của bạn. Vui lòng thử lại.

# verificationRequestGasLimitHigh
source: Gas limit too high. The system tried to adjust automatically, but your wallet may be re-estimating. Please try again or reduce the metadata size if possible.
vi: Gas limit quá cao. Hệ thống đã cố gắng điều chỉnh, nhưng ví của bạn có thể đang ước tính lại. Vui lòng thử lại hoặc giảm kích thước metadata nếu có thể.

# verificationRequestTimeout
source: Verification request timed out. Please try again.
vi: Yêu cầu xác thực đã hết thời gian. Vui lòng thử lại.

# walletConnectSessionDisconnected
source: WalletConnect session was disconnected. Please reconnect your wallet.
vi: Phiên WalletConnect đã bị ngắt kết nối. Vui lòng kết nối lại ví.

source: Verifying credential...
vi: Đang xác thực credential...

# verifyCredentialDialogTitle
source: Verify Credential
vi: Xác thực credential

# verifyCredentialDialogMessage
source: Are you sure you want to verify this credential?
vi: Bạn có chắc chắn muốn xác thực credential này?

# verifyCredentialConfirm
source: Verify
vi: Xác thực

# credentialVerifiedMessage
source: Credential verified: {hash}
vi: Credential đã được xác thực: {hash}

# verifyCredentialCancelled
source: Credential verification was cancelled in your wallet. Please try again.
vi: Xác thực credential đã bị hủy trong ví. Vui lòng thử lại.

# requestVerificationButton
source: Request Verification
vi: Gửi yêu cầu xác thực

# verifyButton
source: Verify
vi: Xác thực

# credentialDetailsSectionTitle
source: Details
vi: Chi tiết

# credentialFilesSectionTitle
source: Files
vi: Tệp đính kèm

# credentialDetailTypeLabel
source: Type
vi: Loại

# credentialDetailSubjectLabel
source: Subject
vi: Chủ thể

# credentialSignatureLabel
source: Signature
vi: Chữ ký

# credentialVerifiedByLabel
source: Verified By
vi: Được xác minh bởi

# credentialVerifiedAtLabel
source: Verified At
vi: Thời gian xác minh

# credentialGatewayDefault
source: Default
vi: Mặc định

# credentialGatewayOriginal
source: Original
vi: Gốc

# documentLabel
source: Document
vi: Tài liệu

source: Open in browser
vi: Mở trong trình duyệt

# attachmentPreviewUnavailableTitle
source: Cannot preview this file
vi: Không thể xem trước tệp này

# attachmentPreviewUnavailableSubtitle
source: Try another gateway or open it in your browser.
vi: Vui lòng thử gateway khác hoặc mở trong trình duyệt.

# viewFileTooltip
source: View file
vi: Xem tệp
